georgik/esp-idf-component-SDL/examples/snow/sdkconfig.defaults.esp32_s3_eye
# ESP32-S3 Eye Board Configuration Defaults
# Camera development board, 240x240 LCD, 8MB Flash + 8MB OCTAL PSRAM

# Board selection
CONFIG_ESP_BSP_SDL_BOARD_ESP32_S3_EYE=y
CONFIG_ESP_BSP_SDL_BOARD_NAME="ESP32-S3 Eye"

# Target and basic configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32000

# Memory Configuration - 8MB OCTAL PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# Heap allocation preferences (prefer PSRAM for large allocations)
CONFIG_HEAP_ALLOCATION_POLICY_DEFAULT=1

# PSRAM optimizations for OCTAL mode
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_SPEED_80M=y

# Performance optimizations with OCTAL PSRAM
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3

# Display-specific optimizations (240x240 circular LCD)
CONFIG_LCD_DRAW_BUFF_SIZE=8192

# Camera support (OV2640)
CONFIG_CAMERA_ENABLED=y
CONFIG_CAMERA_OV2640_SUPPORT=y

# Digital microphone support
CONFIG_DIGITAL_MICROPHONE_ENABLED=y

# Accelerometer support
CONFIG_ACCELEROMETER_ENABLED=y

# uSD card support
CONFIG_USD_CARD_ENABLED=y